linux/guix/guix-errors.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Guix Errors</title>
<meta name="generator" content="Org mode" />
<link rel='stylesheet' href='/css/default.css' />
<link rel='stylesheet' href='/css/source-code.css' />
</head>
<body>
<div id="preamble" class="status">
<h1 id='site-name'>Bryan Rinders</h1>
<div id='menu'>
  <a href='/'>Home</a>
  <a href='/ctf/index.html'>CTF WriteUps</a>
  <a href='/emacs/index.html'>Emacs</a>
  <a href='/linux/index.html'>Linux Tutorials</a>
  <a href='https://gitlab.com/bryos/dotfiles' target='_blank'>Dotfiles</a>
</div>
<br><hr>
</div>
<div id="content">
<h1 class="title">Guix Errors</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#x-river">[X] River</a></li>
<li><a href="#audio">[ ] Audio Does Not Work</a></li>
<li><a href="#x-installing-nerd-fonts">[X] Installing Nerd Fonts</a></li>
<li><a href="#x-installing-the-nix-package-manager">[X] Installing the Nix Package Manager</a></li>
<li><a href="#x-tty-login-with-x-display-server">[X] TTY login with X display server</a></li>
</ul>
</div>
</div>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2023-11-28 Tue]</span></span>
</p>

<p>
This is a list problems/errors I encounters when trying Gnu Guix for
the first time, some with solutions. Perhaps this is helpful to
someone.
</p>

<div id="outline-container-org817dcbb" class="outline-2">
<h2 id="x-river"><a href="#x-river">[X] River</a></h2>
<div class="outline-text-2" id="text-x-river">
<dl class="org-dl">
<dt>Problem</dt><dd><code>riverctl list-inputs</code> produces an error..</dd>
<dt>Solution</dt><dd>install <code>libinput</code>.</dd>
</dl>
</div>
</div>

<div id="outline-container-org3df55d0" class="outline-2">
<h2 id="audio"><a href="#audio">[ ] Audio Does Not Work</a></h2>
<div class="outline-text-2" id="text-audio">
<p>
<code>sof-firmware</code> (from non-guix) does not fix it. No solution found yet.
</p>
</div>
</div>

<div id="outline-container-org8ee37fe" class="outline-2">
<h2 id="x-installing-nerd-fonts"><a href="#x-installing-nerd-fonts">[X] Installing Nerd Fonts</a></h2>
<div class="outline-text-2" id="text-x-installing-nerd-fonts">
<ul class="org-ul">
<li>Manually install:
<ol class="org-ol">
<li>download zip from website</li>
<li>unzip in <code>~/.local/share/fonts/ttf/mononoki-nerd-font</code></li>
<li>update cache with <code>fc-cache</code>.</li>
</ol></li>

<li><p>
Using guix:
</p>

<p>
Or check out <a href="https://gitlab.com/bryanrinders/channel-b">channel-b</a> my personal guix channel for the Nerd Font
packages.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org5eff6aa" class="outline-2">
<h2 id="x-installing-the-nix-package-manager"><a href="#x-installing-the-nix-package-manager">[X] Installing the Nix Package Manager</a></h2>
<div class="outline-text-2" id="text-x-installing-the-nix-package-manager">
<ol class="org-ol">
<li>add <code>nix-service-type</code> to the guix system configuration.</li>
<li>add a channel to nix: <code>nix-channel --add &lt;channel-url&gt;</code>.</li>
<li><p>
update the nix channels, <code>nix-channel --update</code>. It might be
necessary to restart the nix daemon,
<code>sudo herd restart nix-daemon</code>.
</p>

<p>
Note: Restarting the daemon is necessary after every boot (for me),
not sure why.
</p></li>
<li>install packages with nix.</li>
</ol>
</div>
</div>

<div id="outline-container-org5ae1e80" class="outline-2">
<h2 id="x-tty-login-with-x-display-server"><a href="#x-tty-login-with-x-display-server">[X] TTY login with X display server</a></h2>
<div class="outline-text-2" id="text-x-tty-login-with-x-display-server">
<ol class="org-ol">
<li>add the <code>xorg-server-service-type</code> to the system configuration.</li>
<li>copy <code>.xinitrc</code> to <code>~/.config/sx/sxrc</code> and make the file
executable.</li>
<li>add <code>sx</code> to the list of packages</li>
<li>use <code>sx</code>, instead of <code>startx</code>, to start the X display server.</li>
</ol>

<p>
For more detailed instructions go <a href="https://mail.gnu.org/archive/html/help-guix/2021-08/msg00089.html">here</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<br><br>
<div style='text-align: center;'>
  If something is not working, please create an issue
  <a href='https://gitlab.com/bryanrinders/bryanrinders.xyz/-/issues'>here</a>.
</div>
<br><hr/>
<footer>
  <div class='copyright-container'>
    <div class='copyright'>
      Copyright &copy; 2022-2024 Bryan Rinders some rights reserved
      <br><br>
      This page is available under a
      <a rel='license' href='http://creativecommons.org/licenses/by/4.0/'>
        CC-BY 4.0
      </a> licence.
    </div>
  </div>
  <br>
  <div class='generated'>
    Created with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3) on <a href='https://www.gnu.org'>GNU</a>+<a href='https://www.kernel.org/'>Linux</a>
  </div>
</footer>
</div>
</body>
</html>
